Project/Toir/src/InformationRegisters/ЗначенияСчетчиков/ЗначенияСчетчиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияСчетчиков</name>
  <resources>
    <name>НомерПоСчетчику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерРодителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ОбъектыНоменклатуры</types>
      <types>CatalogRef.Классы</types>
      <types>CatalogRef.НоменклатураКласса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Счетчик</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/ТипыСтрокШаблона/ТипыСтрокШаблона.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСтрокШаблона</name>
  <enumValues>
    <name>РеквизитРодителя</name>
  </enumValues>
  <enumValues>
    <name>АтрибутРодителя</name>
  </enumValues>
  <enumValues>
    <name>РеквизитОбъекта</name>
  </enumValues>
  <enumValues>
    <name>АтрибутОбъекта</name>
  </enumValues>
  <enumValues>
    <name>Текст</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/РеквизитыДляВывода/РеквизитыДляВывода.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РеквизитыДляВывода</name>
  <enumValues>
    <name>Код</name>
  </enumValues>
  <enumValues>
    <name>Наименование</name>
  </enumValues>
  <enumValues>
    <name>Счетчик</name>
  </enumValues>
  <enumValues>
    <name>Значение</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Catalogs/Классы/Классы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Классы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ВидыТехОпераций</name>
      <description>Виды тех.операции</description>
    </items>
    <items>
      <name>ВложенныеТехКарты</name>
      <description>Вложенные тех карты</description>
    </items>
    <items>
      <name>КлассыТехКарт</name>
      <description>Классы тех. карт</description>
    </items>
    <items>
      <name>СтрокиТехОпераций</name>
      <description>Строки тех.операций</description>
    </items>
    <items>
      <name>ТехнологическиеКарты</name>
      <description>Технологические карты</description>
    </items>
    <items>
      <name>ТипыТехКарт</name>
      <description>Типы тех. карт</description>
    </items>
    <items>
      <name>Оборудование</name>
      <description>Оборудование</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьВИерархииТО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАтрибута</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураКласса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектыНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассТабличнаяЧасть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаКласса</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаКласса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияКласса</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаНоменклатуры</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияНоменклатуры</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаОбъекта</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияОбъекта</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикКлассов</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикНоменклатуры</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикОбъектовНоменклатуры</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоСчетчику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШагСчетчика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрисвоенНомерПоШаблону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимКонтроляДублейПоНаименованию</name>
    <type>
      <types>EnumRef.РежимыКонтроляДублей</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольДублейВПределахКласса</name>
    <type>
      <types>CatalogRef.Классы</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/Catalogs/НоменклатураКласса/НоменклатураКласса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НоменклатураКласса</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>CatalogRef.Классы</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитНоменклатуруКласса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоСчетчику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрисвоенНомерПоШаблону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШагСчетчика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектТОиР</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/Catalogs/ШаблоныЗаполнения/ШаблоныЗаполнения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныЗаполнения</name>
  <hierarchical>true</hierarchical>
  <tabularSections>
    <name>ЭлементыШаблона</name>
    <attributes>
      <name>ИспользованиеСУровня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипСтроки</name>
      <type>
        <types>EnumRef.ТипыСтрокШаблона</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньРодителя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АтрибутКласса</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.АтрибутыКласса</types>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитДляВывода</name>
      <type>
        <types>EnumRef.РеквизитыДляВывода</types>
      </type>
    </attributes>
    <attributes>
      <name>Формат</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьФормулуДляШага</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ШагСчетчика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФормулаДляШага</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДляПроверки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/CommonModules/ШаблоныСтрокСервер/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьНовоеЗначениеСчетчика(Счетчик, ШагСчетчика, НомерРодителя=0, ШагСчетчикаРодителя=0) Экспорт
	
	ТекЗначение = 0;
	
	БезУчетаРодителя = (НомерРодителя = 0) ИЛИ (ШагСчетчика = ШагСчетчикаРодителя);
	
	Запрос = Новый запрос;
	Запрос.УстановитьПараметр("Счетчик", Счетчик);
	Запрос.УстановитьПараметр("БезУчетаРодителя", БезУчетаРодителя);
	Запрос.УстановитьПараметр("НомерРодителя", НомерРодителя);
	Запрос.Текст = 	
		"ВЫБРАТЬ
		|	МАКСИМУМ(ЗначенияСчетчиков.НомерПоСчетчику) КАК НомерПоСчетчику
		|ИЗ
		|	РегистрСведений.ЗначенияСчетчиков КАК ЗначенияСчетчиков
		|ГДЕ
		|	ЗначенияСчетчиков.Счетчик = &Счетчик
		|	И (&БезУчетаРодителя
		|			ИЛИ ЗначенияСчетчиков.НомерРодителя = &НомерРодителя)";
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		ТекЗначение = Результат.НомерПоСчетчику;
		Если НЕ ЗначениеЗаполнено(ТекЗначение) Тогда
			ТекЗначение = НомерРодителя;
		КонецЕсли;
	КонецЕсли;
	
	НовоеЗначение = ТекЗначение - ТекЗначение % ШагСчетчика + ШагСчетчика;
	Если НЕ БезУчетаРодителя Тогда
		ТекЗначениеРодителя = ТекЗначение - ТекЗначение % ШагСчетчикаРодителя;
		Если НовоеЗначение >= ТекЗначениеРодителя + ШагСчетчикаРодителя Тогда
			Запрос.УстановитьПараметр("БезУчетаРодителя", Истина);
			Результат = Запрос.Выполнить().Выбрать();
			Результат.Следующий();
			ТекЗначение = Результат.НомерПоСчетчику;
			НовоеЗначение = ТекЗначение - ТекЗначение % ШагСчетчикаРодителя + ШагСчетчикаРодителя + ШагСчетчика;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НовоеЗначение;
	
КонецФункции

Функция СформироватьЗначениеПоШаблону(Объект, Шаблон, 
		НомерПоСчетчику, ШагСчетчика, Отказ=Ложь, ФормироватьЗначениеСчетчика=Истина, ВыводитьОшибки=Истина, МассивОшибок=Неопределено) Экспорт
	
	ЗначениеПоШаблону = Неопределено;
	
	// Считываем источник данных для формирования значения по шаблону.
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.Классы") Тогда
		РеквизитыОбъекта = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначенияРеквизитовОбъекта(
			Объект, "Код, Наименование");
		
		СписокРодителей  = Справочники.Классы.ПолучитьТаблицуРодителей(Объект, 
			"Код, Наименование, СчетчикКлассов, ПрисвоенНомерПоШаблону, НомерПоСчетчику, ШагСчетчика, ШаблонКодаКласса");
		СписокРодителей.Колонки.Добавить("ТаблицаАтрибутов");
		
		РеквизитСчетчикПервогоРодителя = "СчетчикКлассов";
		РеквизитСчетчикВторогоРодителя = "СчетчикКлассов";
		РеквизитСчетчикРодителя        = "СчетчикКлассов";
		
		УровеньОбъекта = СписокРодителей.Количество();
		
		ТаблицаАтрибутов = Справочники.Классы.ПолучитьТаблицуАтрибутов(СписокРодителей);
		
		ПредставлениеОбъекта = Строка(Объект);
		
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.НоменклатураКласса") Тогда
		РеквизитыОбъекта = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначенияРеквизитовОбъекта(
			Объект, "Код, Наименование, Класс");
		
		СписокРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(РеквизитыОбъекта.Класс, 
			"Код, Наименование, СчетчикКлассов, ШаблонКодаКласса, СчетчикНоменклатуры, 
			|ПрисвоенНомерПоШаблону, НомерПоСчетчику, ШагСчетчика");
		СписокРодителей.Колонки.Добавить("ТаблицаАтрибутов");
		
		РеквизитСчетчикПервогоРодителя = "СчетчикНоменклатуры";
		РеквизитСчетчикВторогоРодителя = "СчетчикКлассов";
		РеквизитСчетчикРодителя        = "СчетчикКлассов";
		
		УровеньОбъекта = СписокРодителей.Количество() + 1;
		
		ТаблицаАтрибутов = Справочники.НоменклатураКласса.ПолучитьТаблицуАтрибутов(Объект);
		
		ПредставлениеОбъекта = Строка(Объект);
		
	ИначеЕсли ТипЗнч(Объект) = Тип("Структура") Тогда
		РеквизитыОбъекта = Объект;
		
		СписокРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(РеквизитыОбъекта.Класс, 
			"Код, Наименование, СчетчикКлассов, ШаблонКодаКласса, СчетчикНоменклатуры, 
			|ПрисвоенНомерПоШаблону, НомерПоСчетчику, ШагСчетчика");
		СписокРодителей.Колонки.Добавить("ТаблицаАтрибутов");
		
		РеквизитСчетчикПервогоРодителя = "СчетчикНоменклатуры";
		РеквизитСчетчикВторогоРодителя = "СчетчикКлассов";
		РеквизитСчетчикРодителя        = "СчетчикКлассов";
		УровеньОбъекта = СписокРодителей.Количество() + 1;
		
		ТаблицаАтрибутов = Объект.ТаблицаАтрибутов;
		
		ПредставлениеОбъекта = Объект.ПредставлениеОбъекта;
		
	КонецЕсли;
	
	ЗаголовокСообщения = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
		НСтр("ru='Для объекта ''%1'' по шаблону ''%2'' не удалось сформировать значение.'"), ПредставлениеОбъекта, Шаблон);
	Если МассивОшибок = Неопределено Тогда
		МассивОшибок = Новый Массив;
	КонецЕсли;
	
	// Считываем шаблон.
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", Шаблон);
	Запрос.УстановитьПараметр("УровеньОбъекта", УровеньОбъекта);
	Запрос.Текст = ТекстЗапросаЭлементыШаблонаВременныеТаблицы();
	Запрос.Выполнить();
	
	Запрос.Текст = ТекстЗапросаЭлементыШаблона();
	Результаты = Запрос.ВыполнитьПакет();
	
	УровеньСчетчикаРодителя = 0;
	ИспользованиеСУровня = УровеньОбъекта;
	
	// Формирование номера по счетчику с макс. уровнем использования.
	ВыборкаСчетчики = Результаты[0].Выбрать();
	Если ФормироватьЗначениеСчетчика И НЕ ЗначениеЗаполнено(НомерПоСчетчику) И ВыборкаСчетчики.Следующий() Тогда
		УровеньРодителя = ?(ЗначениеЗаполнено(ВыборкаСчетчики.УровеньРодителя), 
			ВыборкаСчетчики.УровеньРодителя, УровеньОбъекта - 1);
		УровеньСчетчикаРодителя = УровеньРодителя;
		Если УровеньРодителя = УровеньОбъекта - 1 Тогда
			РеквизитСчетчикРодителя = РеквизитСчетчикПервогоРодителя;
		КонецЕсли;
		ИспользованиеСУровня = ВыборкаСчетчики.ИспользованиеСУровня;
		
		РеквизитыРодителя = СписокРодителей[УровеньРодителя - 1];
		Счетчик = РеквизитыРодителя[РеквизитСчетчикРодителя];
		
		ШаблонРодителя  = Справочники.Классы.ПолучитьЗначениеРодителя(
			СписокРодителей, УровеньОбъекта - 2, "ШаблонКодаКласса");
		СчетчикРодителя = ПолучитьСчетчикДляУровня(ШаблонРодителя, УровеньОбъекта - 1, 
			СписокРодителей, РеквизитСчетчикВторогоРодителя);
		
		// Непосредственный родитель класса.
		РеквизитыРодителя = СписокРодителей[УровеньОбъекта - 2];
		ЗаголовокСтроки = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
			НСтр("ru='Строка шаблона: %1.'"), ВыборкаСчетчики.НомерСтроки);
		Если НЕ ЗначениеЗаполнено(Счетчик) Тогда
			ТекстОшибки = ЗаголовокСтроки + " " + НСтр("ru='Не заполнен счетчик класса-родителя.'");
			МассивОшибок.Добавить(ТекстОшибки);
			
		Иначе
			Если ВыборкаСчетчики.ИспользоватьФормулуДляШага Тогда
				ШагСчетчика = РассчитатьШагДляСчетчика(
					ВыборкаСчетчики.ФормулаДляШага, УровеньОбъекта, Отказ, ЗаголовокСообщения, МассивОшибок);
			Иначе
				ШагСчетчика = ВыборкаСчетчики.ШагСчетчика;
			КонецЕсли;
			
			Если НЕ Отказ Тогда
				Если РеквизитыРодителя.ПрисвоенНомерПоШаблону 
						И НЕ СчетчикРодителя = Неопределено И СчетчикРодителя.Счетчик = Счетчик
						И РеквизитыРодителя.НомерПоСчетчику > 0 И ШагСчетчика > РеквизитыРодителя.ШагСчетчика Тогда
					ТекстОшибки =  ЗаголовокСтроки + " " + НСтр("ru='Шаг счетчика подчиненного элемента 
						|не должен быть больше шага счетчика класса-родителя.'");
					МассивОшибок.Добавить(ТекстОшибки);
				Иначе
					Если НЕ СчетчикРодителя = Неопределено И СчетчикРодителя.Счетчик = Счетчик Тогда
						НомерРодителя = РеквизитыРодителя.НомерПоСчетчику;
						ШагРодителя   = РеквизитыРодителя.ШагСчетчика;
					Иначе
						НомерРодителя = 0;
						ШагРодителя   = 0;
					КонецЕсли;
					НомерПоСчетчику = ПолучитьНовоеЗначениеСчетчика(Счетчик, ШагСчетчика, НомерРодителя, ШагРодителя);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Кэширование номера родителя для счетчиков, влияющих на нумерацию уровнем выше.
	СоответствиеСчетчиковНомеров = Новый Соответствие;
	Пока ВыборкаСчетчики.Следующий() Цикл
		Если ИспользованиеСУровня > 1 Тогда
			РеквизитыРодителя = СписокРодителей[ИспользованиеСУровня - 2];
			НомерРодителя = РеквизитыРодителя.НомерПоСчетчику;
		Иначе
			НомерРодителя = 0;
		КонецЕсли;
		УровеньРодителя = ?(ЗначениеЗаполнено(ВыборкаСчетчики.УровеньРодителя), 
			ВыборкаСчетчики.УровеньРодителя, УровеньОбъекта - 1);
		СоответствиеСчетчиковНомеров.Вставить(УровеньРодителя, НомерРодителя);
		ИспользованиеСУровня = ВыборкаСчетчики.ИспользованиеСУровня;
	КонецЦикла;
	
	
	// Формируем значение по шаблону.
	Выборка = Результаты[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗаголовокСтроки = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
			НСтр("ru='Строка шаблона: %1.'"), Выборка.НомерСтроки);
		НеФорматировать = Ложь;
		
		Если Выборка.ИспользованиеСУровня > УровеньОбъекта Тогда
			Продолжить;
			
		ИначеЕсли Выборка.ТипСтроки = Перечисления.ТипыСтрокШаблона.Текст Тогда
			ЗначениеДляВывода = Выборка.Формат;
			НеФорматировать = Истина;
			
		ИначеЕсли Выборка.ТипСтроки = Перечисления.ТипыСтрокШаблона.РеквизитОбъекта Тогда
			
			Если Выборка.РеквизитДляВывода = Перечисления.РеквизитыДляВывода.Код Тогда
				ЗначениеДляВывода = РеквизитыОбъекта.Код;
				
			ИначеЕсли Выборка.РеквизитДляВывода = Перечисления.РеквизитыДляВывода.Наименование Тогда
				ЗначениеДляВывода = РеквизитыОбъекта.Наименование;
				
			КонецЕсли;
			
		ИначеЕсли Выборка.ТипСтроки = Перечисления.ТипыСтрокШаблона.АтрибутОбъекта
				ИЛИ Выборка.ТипСтроки = Перечисления.ТипыСтрокШаблона.АтрибутРодителя
					И Выборка.УровеньРодителя = УровеньОбъекта Тогда
			
			ЗначениеДляВывода = ПолучитьЗначениеАтрибута(
				ТаблицаАтрибутов, Выборка.АтрибутКласса, Выборка.РеквизитДляВывода, 
				ЗаголовокСтроки, МассивОшибок);
			
		ИначеЕсли Выборка.ТипСтроки = Перечисления.ТипыСтрокШаблона.РеквизитРодителя Тогда
			УровеньРодителя = ?(ЗначениеЗаполнено(Выборка.УровеньРодителя), 
				Выборка.УровеньРодителя, УровеньОбъекта - 1);
			РеквизитыРодителя = СписокРодителей[УровеньРодителя - 1];
			Если Выборка.РеквизитДляВывода = Перечисления.РеквизитыДляВывода.Код Тогда
				ЗначениеДляВывода = РеквизитыРодителя.Код;
				
			ИначеЕсли Выборка.РеквизитДляВывода = Перечисления.РеквизитыДляВывода.Наименование Тогда
				ЗначениеДляВывода = РеквизитыРодителя.Наименование;
				
			ИначеЕсли Выборка.РеквизитДляВывода = Перечисления.РеквизитыДляВывода.Счетчик Тогда
				Если УровеньРодителя < УровеньСчетчикаРодителя Тогда
					ЗначениеДляВывода = Формат(СоответствиеСчетчиковНомеров[УровеньРодителя], "ЧН=; ЧГ=0");
				Иначе
					ЗначениеДляВывода = Формат(НомерПоСчетчику, "ЧН=; ЧГ=0");
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли Выборка.ТипСтроки = Перечисления.ТипыСтрокШаблона.АтрибутРодителя Тогда
			УровеньРодителя = ?(ЗначениеЗаполнено(Выборка.УровеньРодителя), 
				Выборка.УровеньРодителя, УровеньОбъекта - 1);
			РеквизитыРодителя = СписокРодителей[УровеньРодителя - 1]; 
			Если РеквизитыРодителя.ТаблицаАтрибутов = Неопределено Тогда
				РеквизитыРодителя.ТаблицаАтрибутов = ПолучитьТаблицуАтрибутовРодителя(СписокРодителей, УровеньРодителя);
			КонецЕсли;
			
			ЗначениеДляВывода = ПолучитьЗначениеАтрибута(
				РеквизитыРодителя.ТаблицаАтрибутов, Выборка.АтрибутКласса, Выборка.РеквизитДляВывода, 
				ЗаголовокСтроки, МассивОшибок);
			
		КонецЕсли;
		
		Если Выборка.Количество() = 1 И НЕ ЗначениеЗаполнено(Выборка.Формат) Тогда
			ЗначениеПоШаблону = ЗначениеДляВывода;
		Иначе
			ЗначениеПоШаблону = ?(ЗначениеПоШаблону = Неопределено, "", ЗначениеПоШаблону) 
				+ ?(ЗначениеЗаполнено(Выборка.Формат) И (НеФорматировать = Ложь), 
					ШаблоныСтрокКлиентСервер.ФорматироватьСтроку(ЗначениеДляВывода, Выборка.Формат, Отказ, МассивОшибок), 
					Строка(ЗначениеДляВывода));
		КонецЕсли;
		
	КонецЦикла;
	
	Если ВыводитьОшибки И МассивОшибок.Количество() > 0 Тогда
		Для Каждого ТекстСообщения ИЗ МассивОшибок Цикл
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , Отказ);
		КонецЦикла;
		
	ИначеЕсли МассивОшибок.Количество() > 0 Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Возврат ЗначениеПоШаблону;
	
КонецФункции

Функция ПолучитьСчетчикДляУровня(Шаблон, Уровень, СписокРодителей, РеквизитСчетчикРодителя) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", Шаблон);
	Запрос.УстановитьПараметр("УровеньОбъекта", Уровень);
	Запрос.Текст = ТекстЗапросаЭлементыШаблонаВременныеТаблицы();
	Запрос.Выполнить();
	
	Запрос.Текст = ТекстЗапросаЭлементыШаблона();
	Результаты = Запрос.ВыполнитьПакет();
	
	Счетчик = Неопределено;
	
	ВыборкаСчетчики = Результаты[0].Выбрать();
	Если ВыборкаСчетчики.Следующий() Тогда
		УровеньРодителя = ?(ЗначениеЗаполнено(ВыборкаСчетчики.УровеньРодителя), 
			ВыборкаСчетчики.УровеньРодителя, Уровень - 1);
		РеквизитыРодителя = СписокРодителей[УровеньРодителя - 1];
		Счетчик = Новый Структура("Счетчик, ИспользованиеСУровня",
			РеквизитыРодителя[РеквизитСчетчикРодителя], ВыборкаСчетчики.ИспользованиеСУровня);
	КонецЕсли;
	
	Возврат Счетчик;
	
КонецФункции

Функция АтрибутИспользуетсяВШаблоне(АтрибутКласса, Шаблон) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",        Шаблон);
	Запрос.УстановитьПараметр("АтрибутКласса", АтрибутКласса);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(ШаблоныЗаполненияЭлементыШаблона.Ссылка) ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК АтрибутИспользуется
		|ИЗ
		|	Справочник.ШаблоныЗаполнения.ЭлементыШаблона КАК ШаблоныЗаполненияЭлементыШаблона
		|ГДЕ
		|	ШаблоныЗаполненияЭлементыШаблона.Ссылка = &Ссылка
		|	И ШаблоныЗаполненияЭлементыШаблона.ТипСтроки = ЗНАЧЕНИЕ(Перечисление.ТипыСтрокШаблона.АтрибутОбъекта)
		|	И ШаблоныЗаполненияЭлементыШаблона.АтрибутКласса = &АтрибутКласса";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.АтрибутИспользуется;
	
КонецФункции

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЭлементыШаблонаВременныеТаблицы()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ШаблоныЗаполненияЭлементыШаблона.НомерСтроки КАК НомерСтроки,
		|	ШаблоныЗаполненияЭлементыШаблона.ИспользованиеСУровня,
		|	ШаблоныЗаполненияЭлементыШаблона.ТипСтроки,
		|	ШаблоныЗаполненияЭлементыШаблона.УровеньРодителя,
		|	ШаблоныЗаполненияЭлементыШаблона.АтрибутКласса,
		|	ШаблоныЗаполненияЭлементыШаблона.РеквизитДляВывода,
		|	ШаблоныЗаполненияЭлементыШаблона.Формат,
		|	ШаблоныЗаполненияЭлементыШаблона.ИспользоватьФормулуДляШага,
		|	ШаблоныЗаполненияЭлементыШаблона.ШагСчетчика,
		|	ШаблоныЗаполненияЭлементыШаблона.ФормулаДляШага
		|ПОМЕСТИТЬ ВТ_ЭлементыШаблона
		|ИЗ
		|	Справочник.ШаблоныЗаполнения.ЭлементыШаблона КАК ШаблоныЗаполненияЭлементыШаблона
		|ГДЕ
		|	ШаблоныЗаполненияЭлементыШаблона.Ссылка = &Ссылка
		|	И ШаблоныЗаполненияЭлементыШаблона.ИспользованиеСУровня <= &УровеньОбъекта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЭлементыШаблона.УровеньРодителя,
		|	МАКСИМУМ(ВТ_ЭлементыШаблона.ИспользованиеСУровня) КАК УровеньАктуальныхПараметров,
		|	МИНИМУМ(ВТ_ЭлементыШаблона.ИспользованиеСУровня) КАК ИспользованиеСУровня
		|ПОМЕСТИТЬ ВТ_ИсточникПараметровРасчетаШагаСчетчика
		|ИЗ
		|	ВТ_ЭлементыШаблона КАК ВТ_ЭлементыШаблона
		|ГДЕ
		|	ВТ_ЭлементыШаблона.РеквизитДляВывода = ЗНАЧЕНИЕ(Перечисление.РеквизитыДляВывода.Счетчик)
		|	И ВТ_ЭлементыШаблона.ТипСтроки = ЗНАЧЕНИЕ(Перечисление.ТипыСтрокШаблона.РеквизитРодителя)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЭлементыШаблона.УровеньРодителя";
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаЭлементыШаблона()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_ЭлементыШаблона.НомерСтроки,
		|	ВТ_ЭлементыШаблона.УровеньРодителя КАК УровеньРодителя,
		|	ВТ_ИсточникПараметровРасчетаШагаСчетчика.ИспользованиеСУровня КАК ИспользованиеСУровня,
		|	ВТ_ЭлементыШаблона.ИспользоватьФормулуДляШага,
		|	ВТ_ЭлементыШаблона.ШагСчетчика,
		|	ВТ_ЭлементыШаблона.ФормулаДляШага
		|ИЗ
		|	ВТ_ИсточникПараметровРасчетаШагаСчетчика КАК ВТ_ИсточникПараметровРасчетаШагаСчетчика
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЭлементыШаблона КАК ВТ_ЭлементыШаблона
		|		ПО ВТ_ИсточникПараметровРасчетаШагаСчетчика.УровеньРодителя = ВТ_ЭлементыШаблона.УровеньРодителя
		|			И ВТ_ИсточникПараметровРасчетаШагаСчетчика.УровеньАктуальныхПараметров = ВТ_ЭлементыШаблона.ИспользованиеСУровня
		|			И (ВТ_ЭлементыШаблона.ТипСтроки = ЗНАЧЕНИЕ(Перечисление.ТипыСтрокШаблона.РеквизитРодителя))
		|			И (ВТ_ЭлементыШаблона.РеквизитДляВывода = ЗНАЧЕНИЕ(Перечисление.РеквизитыДляВывода.Счетчик))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИспользованиеСУровня УБЫВ,
		|	УровеньРодителя УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЭлементыШаблона.НомерСтроки КАК НомерСтроки,
		|	ВТ_ЭлементыШаблона.ИспользованиеСУровня,
		|	ВТ_ЭлементыШаблона.ТипСтроки,
		|	ВТ_ЭлементыШаблона.УровеньРодителя,
		|	ВТ_ЭлементыШаблона.АтрибутКласса,
		|	ВТ_ЭлементыШаблона.РеквизитДляВывода,
		|	ВТ_ЭлементыШаблона.Формат,
		|	ВТ_ЭлементыШаблона.ИспользоватьФормулуДляШага,
		|	ВТ_ЭлементыШаблона.ШагСчетчика,
		|	ВТ_ЭлементыШаблона.ФормулаДляШага
		|ИЗ
		|	ВТ_ЭлементыШаблона КАК ВТ_ЭлементыШаблона
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТаблицуАтрибутовРодителя(СписокРодителей, Уровень)
	
	СписокРодителейРодителя = СписокРодителей.СкопироватьКолонки();
	Для Н = 1 По Уровень Цикл
		СтрокаРодитель = СписокРодителейРодителя.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРодитель, СписокРодителей[Н - 1]);
	КонецЦикла;
	
	СписокРодителейРодителя.ЗаполнитьЗначения(СписокРодителейРодителя[Уровень - 1].Класс, "КлассДляЧтения");
	
	ТаблицаАтрибутов = Справочники.Классы.ПолучитьТаблицуАтрибутов(СписокРодителейРодителя);
	
	Возврат ТаблицаАтрибутов;
	
КонецФункции

Функция ПолучитьЗначениеАтрибута(ТаблицаАтрибутов, АтрибутКласса, РеквизитДляВывода, ЗаголовокСтроки, МассивОшибок)
	
	СтрокаАтрибута = ТаблицаАтрибутов.Найти(АтрибутКласса, "АтрибутКласса");
	Если СтрокаАтрибута = Неопределено Тогда
		ТекстОшибки = ЗаголовокСтроки + " " + УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
			НСтр("ru='Атрибут ''%1'' не найден.'"), Строка(АтрибутКласса));
		МассивОшибок.Добавить(ТекстОшибки);
	ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаАтрибута.ЗначениеАтрибутаКласса) Тогда
		ТекстОшибки = ЗаголовокСтроки + " " + УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
			НСтр("ru='Значение атрибута ''%1'' не заполнено.'"), Строка(АтрибутКласса));
		МассивОшибок.Добавить(ТекстОшибки);
		
	Иначе
		
		Если РеквизитДляВывода = Перечисления.РеквизитыДляВывода.Значение Тогда
			ЗначениеДляВывода = СтрокаАтрибута.ЗначениеАтрибутаКласса;
		Иначе
			РеквизитыАтрибута = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначенияРеквизитовОбъекта(
				СтрокаАтрибута.ЗначениеАтрибутаКласса, "Код, Наименование");
				
			Если РеквизитДляВывода = Перечисления.РеквизитыДляВывода.Код Тогда
				ЗначениеДляВывода = РеквизитыАтрибута.Код;
			ИначеЕсли РеквизитДляВывода = Перечисления.РеквизитыДляВывода.Наименование Тогда
				ЗначениеДляВывода = РеквизитыАтрибута.Наименование;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЗначениеДляВывода;
	
КонецФункции

Функция РассчитатьШагДляСчетчика(ФормулаДляШага, Уровень, Отказ, ЗаголовокСообщения, МассивОшибок)
	
	Попытка
		
		Результат = Вычислить(ФормулаДляШага);
		
	Исключение
		Отказ = Истина;
		ТекстОшибки = НСтр("ru='Ошибка при вычислении шага для счетчика:'")
			+ КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		МассивОшибок.Добавить(ЗаголовокСообщения + " " + ТекстОшибки);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
